{
  "_name_or_path": "microsoft/beit-base-patch16-224",
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "active",
    "1": "afraid",
    "2": "alarmed",
    "3": "alert",
    "4": "amazed",
    "5": "amused",
    "6": "angry",
    "7": "calm",
    "8": "cheerful",
    "9": "confident",
    "10": "conscious",
    "11": "creative",
    "12": "disturbed",
    "13": "eager",
    "14": "educated",
    "15": "emotional",
    "16": "empathetic",
    "17": "fashionable",
    "18": "feminine",
    "19": "grateful",
    "20": "inspired",
    "21": "jealous",
    "22": "loving",
    "23": "manly",
    "24": "persuaded",
    "25": "pessimistic",
    "26": "proud",
    "27": "sad",
    "28": "thrifty",
    "29": "youthful"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "active": 0,
    "afraid": 1,
    "alarmed": 2,
    "alert": 3,
    "amazed": 4,
    "amused": 5,
    "angry": 6,
    "calm": 7,
    "cheerful": 8,
    "confident": 9,
    "conscious": 10,
    "creative": 11,
    "disturbed": 12,
    "eager": 13,
    "educated": 14,
    "emotional": 15,
    "empathetic": 16,
    "fashionable": 17,
    "feminine": 18,
    "grateful": 19,
    "inspired": 20,
    "jealous": 21,
    "loving": 22,
    "manly": 23,
    "persuaded": 24,
    "pessimistic": 25,
    "proud": 26,
    "sad": 27,
    "thrifty": 28,
    "youthful": 29
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_indices": [
    3,
    5,
    7,
    11
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.33.0",
  "use_absolute_position_embeddings": false,
  "use_auxiliary_head": true,
  "use_mask_token": false,
  "use_mean_pooling": true,
  "use_relative_position_bias": true,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}