{
  "_name_or_path": "microsoft/beit-base-patch16-224",
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "action",
    "1": "america",
    "2": "attractive",
    "3": "care",
    "4": "clean",
    "5": "clothing",
    "6": "cold",
    "7": "color",
    "8": "confidence",
    "9": "confusion",
    "10": "control",
    "11": "culture",
    "12": "danger",
    "13": "desire",
    "14": "differ",
    "15": "dirty",
    "16": "emotion",
    "17": "energy",
    "18": "entertainment",
    "19": "fashion",
    "20": "flight",
    "21": "food",
    "22": "gift",
    "23": "growth",
    "24": "health",
    "25": "holiday",
    "26": "home",
    "27": "hot",
    "28": "hunger",
    "29": "light",
    "30": "natural",
    "31": "negative emotion",
    "32": "new",
    "33": "none",
    "34": "old",
    "35": "pollution",
    "36": "positive emotion",
    "37": "quality",
    "38": "relationship",
    "39": "rugged",
    "40": "safe",
    "41": "sex",
    "42": "simple",
    "43": "size",
    "44": "speed",
    "45": "sport",
    "46": "strength",
    "47": "success",
    "48": "support",
    "49": "unhealthy",
    "50": "water",
    "51": "wealth",
    "52": "wild"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "action": 0,
    "america": 1,
    "attractive": 2,
    "care": 3,
    "clean": 4,
    "clothing": 5,
    "cold": 6,
    "color": 7,
    "confidence": 8,
    "confusion": 9,
    "control": 10,
    "culture": 11,
    "danger": 12,
    "desire": 13,
    "differ": 14,
    "dirty": 15,
    "emotion": 16,
    "energy": 17,
    "entertainment": 18,
    "fashion": 19,
    "flight": 20,
    "food": 21,
    "gift": 22,
    "growth": 23,
    "health": 24,
    "holiday": 25,
    "home": 26,
    "hot": 27,
    "hunger": 28,
    "light": 29,
    "natural": 30,
    "negative emotion": 31,
    "new": 32,
    "none": 33,
    "old": 34,
    "pollution": 35,
    "positive emotion": 36,
    "quality": 37,
    "relationship": 38,
    "rugged": 39,
    "safe": 40,
    "sex": 41,
    "simple": 42,
    "size": 43,
    "speed": 44,
    "sport": 45,
    "strength": 46,
    "success": 47,
    "support": 48,
    "unhealthy": 49,
    "water": 50,
    "wealth": 51,
    "wild": 52
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_indices": [
    3,
    5,
    7,
    11
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "multi_label_classification",
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0",
  "use_absolute_position_embeddings": false,
  "use_auxiliary_head": true,
  "use_mask_token": false,
  "use_mean_pooling": true,
  "use_relative_position_bias": true,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}
